do

local function run(msg, matches)

local reply_id = msg['id']
if is_momod(msg) and matches[1] == 'م2' then 
    local ghost = [[
    🔹 أوامر الحماية داخل المجموعة 🔹
::::::::::::::::::::::::::::::::::::::::
🔹طرد <معرف-رد> : طرد | ⛔️
🔹كتم <معرف-رد> : كتم | 🔕
🔹حظر <معرف-رد> : حظر | 🚷
🔹المعرف-رد> : الغاء الحظر | ⭕️
🔹قائمة الحظر : المحظورين | 🆘
🔹ايدي : ايدي | 🆔
🔹مغادرة : مغادرة | 🚫
::::::::::::::::::::::::::::::::::::::::
🔹اوامر الفتح والقفل في المجموعة | ✂️
::::::::::::::::::::::::::::::::::::::::
🔹قفل الصوتيات : لمنع الصوتيات | 🔊
🔹قفل المتحركة : لمنع المتحركة | 🎡
🔹قفل الملفات : لمنع الملفات | 🗂
🔹قفل الصور :لمنع الصور | 🌠
🔹قفل الكتابة :لمنع الكتابة | 📝
🔹قفل الفيديوهات : لمنع الفديوات | 🎥
🔹قفل التوجية : لمنع التوجيه | ↩️
🔹قفل التكرار : لمنع التكرار | 🔐
🔹قفل البوتات : لمنع البوتات | 🤖
🔹قفل الروابط : لمنع الروابط | 🔗
🔹قفل الاضافة : لمنع الاضافة | 👤
🔹قفل الاضافة الجماعية : لمنع الاضافة الجماعية | 🚸
🔹قفل اشعارات  :  اشعارات الدخول | ⚛ 
🔹قفل جهات اتصال : جهات الاتصال | 📵
🔹قفل التفليش : لمنع الكلايش الطويله | 📊
🔹قفل المحادثة : لمنع المحادثة | 🔕
🔹قفل العربيه :  اللغة العربية | 🆎
🔹قفل التحذير : الحماية | ⛔️
::::::::::::::::::::::::::::::::::::::::
🔹طريقة استخدام الاوامر 🔹
🔹 قفل + الامر - للقفل
🔹 فتح + الامر - للفتح
♻️〰〰〰〰〰〰〰〰〰♻
https://telegram.me/joinchat/Dc0SDEGKMxbLKDilBccdiQ
♻️〰〰〰〰〰〰〰〰〰♻️ 
💠 pro :- Ahmed jabbar Kasad 
🌟 dev :- @ahmedjabbar1 
📺 Cha :- @TeamTop
    ]]
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "Only Owner or Mod !" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م2)$", 
}, 
run = run 
} 
end
